v2206/atmospheric_Microclimate/benchmark_atmSims/atmDownstreamDevelopment/results/kOmegaSST/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=64;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          250;
        startFace       347250;
    }
    ground
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2500;
        startFace       347500;
    }
    top
    {
        type            patch;
        nFaces          2500;
        startFace       350000;
    }
    sides
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          50000;
        startFace       352500;
    }
    outlet
    {
        type            patch;
        nFaces          250;
        startFace       402500;
    }
)

// ************************************************************************* //
